## Plan for aws/lambda
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_base_path_mapping.rest-api must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "rest-api" {
        api_id      = "7s14db9pfd"
      ~ domain_name = "secret.cdssandbox.xyz" -> "encrypted-message.cdssandbox.xyz" # forces replacement
      ~ id          = "secret.cdssandbox.xyz/" -> (known after apply)
        stage_name  = "prod"
    }

  # aws_api_gateway_domain_name.rest-api must be replaced
-/+ resource "aws_api_gateway_domain_name" "rest-api" {
      ~ arn                     = "arn:aws:apigateway:ca-central-1::/domainnames/secret.cdssandbox.xyz" -> (known after apply)
        certificate_arn         = "arn:aws:acm:us-east-1:637287734259:certificate/23fbeb9e-9b51-4fe4-8cc5-88b37f0cf410"
      ~ certificate_upload_date = "2020-12-21T00:43:26Z" -> (known after apply)
      ~ cloudfront_domain_name  = "d3rcyftzrbkult.cloudfront.net" -> (known after apply)
      ~ cloudfront_zone_id      = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ domain_name             = "secret.cdssandbox.xyz" -> "encrypted-message.cdssandbox.xyz" # forces replacement
      ~ id                      = "secret.cdssandbox.xyz" -> (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      ~ security_policy         = "TLS_1_0" -> (known after apply)
      - tags                    = {} -> null

      ~ endpoint_configuration {
          ~ types = [
              - "EDGE",
            ] -> (known after apply)
        }
    }

  # aws_lambda_function.api_handler will be updated in-place
  ~ resource "aws_lambda_function" "api_handler" {
        arn                            = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda"
        filename                       = "./deployment.zip"
        function_name                  = "secret-production-lambda"
        handler                        = "app.app"
        id                             = "secret-production-lambda"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
      ~ last_modified                  = "2023-01-27T16:29:08.000+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::637287734259:role/secret-production-lambda-iam-role"
        runtime                        = "python3.8"
      ~ source_code_hash               = "3aT/+ySHgaiCSQ2HHXC8reOiOougH+O7uAa6A5I0bE0=" -> "NVWG8DHdS6dlD5wJlw2DUNui+I6QiJ+3notfYMB0v3w="
        source_code_size               = 12314636
        tags                           = {
            "CostCenter" = "secret-production"
            "Name"       = "secret"
        }
        timeout                        = 60
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
                "DYNAMO_TABLE"            = "secret-production-table"
                "ENV"                     = "PRODUCTION"
              ~ "GIT_SHA"                 = "4896729df2f4b66887da660d5acea0cf569b7999" -> "abcdefgh"
                "KMS_ID"                  = "5e112d26-23c0-473d-afbb-2c74deab0894"
                "POWERTOOLS_SERVICE_NAME" = "secret"
            }
        }

        tracing_config {
            mode = "Active"
        }
    }

  # aws_lambda_function.lambda-warmer will be updated in-place
  ~ resource "aws_lambda_function" "lambda-warmer" {
        arn                            = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda-warmer"
        filename                       = "/tmp/lambda-warmer.zip"
        function_name                  = "secret-production-lambda-warmer"
        handler                        = "lambda-warmer.handler"
        id                             = "secret-production-lambda-warmer"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda-warmer/invocations"
        last_modified                  = "2021-01-08T14:39:27.258+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda-warmer:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::637287734259:role/secret-production-lambda-iam-role"
        runtime                        = "python3.8"
        source_code_hash               = "RY4FyyhtEOuNUWB0FSN8YbNsnJtGK/UoFliLk/+CaFc="
        source_code_size               = 404
        tags                           = {
            "CostCenter" = "secret-production"
            "Name"       = "secret"
        }
        timeout                        = 60
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
              ~ "BASE_URL" = "https://secret.cdssandbox.xyz" -> "https://encrypted-message.cdssandbox.xyz"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ CustomDomainName = "d3rcyftzrbkult.cloudfront.net" -> (known after apply)
  ~ CustomDomainZone = "Z2FDTNDATAQYW2" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.dynamodb-table"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda-iam-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.key"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.lambda-warmer"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
